# n = input('Введите трехзначное число: ')
# n = int(n)
#
# if n <= 999:
#     d1 = n % 10
#     n = n // 10
#     d2 = n % 10
#     n = n // 10
#     print('Сумма цифр числа: ', n + d2 + d1)
#
# else:
#     print('Вы ввели неправильное количество цифр!')

# ====================================================

# n = input('Введите число: ')
# n = int(n)
# sum = 0
# while n > 100:
#     x = n % 10
#     sum = sum + x
#     n = n // 10
#
#
# if n <= 99:
#     print("Введите больше цифр!!! Нужно 3 цифры !!!")
#
#
# while n > 100:
#     print("Введите меньше цифр !!!")
#     break
#
# print(f'Сумма введеных чисел = {sum}')

# ========================================

n = input("Введите трехзначное число: ")

a = int(n[0])
b = int(n[1])
c = int(n[2])
print("Сумма цифр числа:", a + b + c)

# ========================================

# n = input("Введите трехзначное число: ")
# n = int(n)
#
# d1 = n % 10
# d2 = n % 100 // 10
# d3 = n // 100
#
# print("Сумма цифр числа:", d1 + d2 + d3)
