# Задача 1. Язык математики
'''
a = 8
b = 10
c = 12
d = 18

f = (- 3 + a ** 2) * b - 2 ** 3 / c - 2 * d
print(f)


# Задача 2. Финансовый отчёт

a = int(input('Write the 1st diggit: '))
b = int(input('Write the 2nd diggit: '))
c = int(input('Write the 3rd diggit: '))
d = int(input('Write the 4th diggit: '))

sum_first_second = a + b
sum_third_fourth = c + d

divide = sum_first_second / sum_third_fourth

print('сумма 1-го и 2-го числа: ', sum_first_second)
print('сумма 3-го и 4-го числа: ', sum_third_fourth)
print('Деление сумм: ', divide)



# Задача 3. Следующее и предыдущее числа

a = int(input('Write number: '))
b = a + 1
c = a - 1
print('next number is: ', b)
print('previous number is: ', c)


# Задача 4. Площадь треугольника

a = int(input('Длина 1-ой стороны: '))
b = int(input('Длина 2-ой стороны: '))

s = a * b / 2
print('Площадь треугольника = ', s)


# Задача 5. Часы

a = int(input('Write the number: '))
b = a // 60
c = a % 60


print('В часах: ', b)
print('В минутах: ', c)
#print('Остаток минут: ', c)


# Задача 6. Проверяем бухгалтера

a = int(input('Write the 1st number: '))
b = int(input('Write the 2nd number: '))


c = a % 100
d = b % 100

print('сумма двух последних цифр числа: ', c + d)

# Задача 7. Режем число на части

a = int(input('Введите 4х значное число: '))
b = a // 1000
c = a % 1000 // 100
d = a % 100 // 10
e = a % 10
print(b, c, d, e)


'''


